---
kind: type
id: T:Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs
source: html/6ac311cc-14e9-639f-a8d7-e321927e0c14.htm
---
# Autodesk.Revit.DB.Events.DocumentSavedAsEventArgs

The event arguments used by the DocumentSavedAs event.

## Syntax (C#)
```csharp
public class DocumentSavedAsEventArgs : RevitAPIPostDocEventArgs
```